<script lang="ts">
    import { Row, Container,Col,CardHeader,CardBody,CardImg,CardText } from "@sveltestrap/sveltestrap";
</script>

<svelte:head>
    <title>Считает себя главной</title>
</svelte:head>

<Container class="shadow-lg p-2">
    <h1>Добро пожаловать на наглую страницу...</h1>
    <p>На нашем сайте можно найти наглую страницу которая считает себя главной но все мы тут знаем что я хозяин на этой странице</p>
    <Row>
        <Col>
            <CardHeader>Бомбардиро Крокодило</CardHeader>
            <CardBody>
                <CardImg src="https://avatars.mds.yandex.net/i?id=2a00000196772b73e2fa23a673bb8b8a9294-1327053-fast-images&n=13"></CardImg>
                <CardText>«Бомбардиро Крокодило» — это персонаж мемов, созданных с помощью искусственного интеллекта. Мем появился в середине февраля 2025 года в TikTok. В нём рассказывается о военном бомбардировщике с лицом крокодила, которого озвучивает мужской итальянский голос.</CardText>
            </CardBody>
        </Col>

        <Col>
            <CardHeader>Тунг Тунг Тунг Сахур</CardHeader>
            <CardBody>
                <CardImg src="https://i.ytimg.com/vi/00kyLpTIzo8/maxresdefault.jpg"></CardImg>
                <CardText>«Тунг Тунг Тунг Сахур» — мемный персонаж, который появился в TikTok в начале 2025 года.

                    Описание: улыбающееся полено с руками, ногами и битой. С персонажем связана жуткая легенда. Звук «тунг-тунг-тунг» имитирует удары в барабан, который жители Индонезии используют в качестве будильника для сахура. « Сахур» означает утренний приём пищи в священный месяц Рамадан в мусульманском календаре. 
                    
                    Легенда: если человека позвали стуком в барабан трижды, а он не ответил, деревянное существо приходит к нему в дом.</CardText>
            </CardBody>
        </Col>
               
        <Col>
            <CardHeader>Бобрито Бандито</CardHeader>
            <CardBody>
                <CardImg src="https://avatars.mds.yandex.net/i?id=2a0000019678bacc169b2c9ef275ab7f5f08-1672552-fast-images&n=13"></CardImg>
                <CardText>«Бобрито Бандито» — персонаж мемов, сгенерированный искусственным интеллектом.  

                    Описание: бобер-гангстер в деловом костюме с винтовкой. На видео он обычно затягивается сигарой, что символизирует решение важных дел.  
                    
                    Образ «Бобрито Бандито» вдохновлён классическими мафиозными фильмами, только вместо Аль Пачино — грызун с пистолетом.  
                    
                    Персонажи подобных мемов называют «нейронные брейнрот-животные» или просто «брейнрот». В начале 2025 года такие ролики стали популярны в социальных сетях, их прозвали «итальянским брейнротом». </CardText>
            </CardBody>
        </Col>
    </Row>
</Container>